tap "homebrew/bundle"
tap "oven-sh/bun"

brew "asdf"
brew "gh"
brew "git"
brew "node"
brew "python@3.11"
brew "yarn"
brew "oven-sh/bun/bun"
brew 'mas'

mas 'Slack', id: 803453959
mas 'Xcode', id: 497799835

vscode "dbaeumer.vscode-eslint"
vscode "dracula-theme.theme-dracula"
vscode "eamodio.gitlens"
vscode "Equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-close-tag"
vscode "formulahendry.auto-rename-tag"
vscode "GraphQL.vscode-graphql-syntax"
vscode "JakeBecker.elixir-ls"
vscode "mquandalle.graphql"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.atom-keybindings"
vscode "oderwat.indent-rainbow"
vscode "pranaygp.vscode-css-peek"
vscode "sleistner.vscode-fileutils"
vscode "steoates.autoimport"
vscode "ue.alphabetical-sorter"
vscode "wayou.vscode-todo-highlight"
vscode "withfig.fig"
vscode "zxh404.vscode-proto3"
